Revit 2027 API
EnergyDataSettings.ProjectPhase Property
 The project phase of the EnergyData information.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProjectPhase { get; set; }
Public Property ProjectPhase As ElementId
	Get
	Set
public:
property ElementId^ ProjectPhase {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ProjectPhase : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input element is not a project phase.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace